gdgly/stm32L151_nbiot_tmote_app_spot/Libraries/NBIot/nbiotfunc.c
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NMSTATUS?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+NMSTATUS?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		/* UNINITIALISED */
		if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:UNINITIALISED")) {
			pClient->Parameter.messageregistration = UNINITIALISED;
		}
		/* MISSING_CONFIG */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:MISSING_CONFIG")) {
			pClient->Parameter.messageregistration = MISSING_CONFIG;
		}
		/* INIT_FAILED */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:INIT_FAILED")) {
			pClient->Parameter.messageregistration = INIT_FAILED;
		}
		/* INIITIALISED */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:INIITIALISED")) {
			pClient->Parameter.messageregistration = INIITIALISED;
		}
		/* REGISTERING */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:REGISTERING")) {
			pClient->Parameter.messageregistration = REGISTERING;
		}
		/* REREGISTERING */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:REREGISTERING")) {
			pClient->Parameter.messageregistration = REREGISTERING;
		}
		/* REGISTERED */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:REGISTERED")) {
			pClient->Parameter.messageregistration = REGISTERED;
		}
		/* REREGISTERED */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:REREGISTERED")) {
			pClient->Parameter.messageregistration = REREGISTERED;
		}
		/* MO_DATA_ENABLED */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:MO_DATA_ENABLED")) {
			pClient->Parameter.messageregistration = MO_DATA_ENABLED;
		}
		/* NO_UE_IP */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:NO_UE_IP")) {
			pClient->Parameter.messageregistration = NO_UE_IP;
		}
		/* MEMORY_ERROR */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:MEMORY_ERROR")) {
			pClient->Parameter.messageregistration = MEMORY_ERROR;
		}
		/* COAP_ERROR */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:COAP_ERROR")) {
			pClient->Parameter.messageregistration = COAP_ERROR;
		}
		/* MSG_SEND_FAILED */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:MSG_SEND_FAILED")) {
			pClient->Parameter.messageregistration = MSG_SEND_FAILED;
		}
		/* REJECTED_BY_SERVER */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:REJECTED_BY_SERVER")) {
			pClient->Parameter.messageregistration = REJECTED_BY_SERVER;
		}
		/* TIMEOUT_AND_RETRYING */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:TIMEOUT_AND_RETRYING")) {
			pClient->Parameter.messageregistration = TIMEOUT_AND_RETRYING;
		}
		/* TIMEOUT_AND_FAILED */
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NMSTATUS:TIMEOUT_AND_FAILED")) {
			pClient->Parameter.messageregistration = TIMEOUT_AND_FAILED;
		}
		else {
			NBStatus = NBIOT_ERROR;
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetAttachOrDetach(NBIOT_ClientsTypeDef* pClient, NBIOT_NetstateTypeDef attdet)
 @Description			NBIOT_Neul_NBxx_SetAttachOrDetach			: 设置终端入网退网
 @Input				pClient								: NBIOT客户端实例
					attdet								: Detach / Attach
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetAttachOrDetach(NBIOT_ClientsTypeDef* pClient, NBIOT_NetstateTypeDef attdet)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+CGATT=%d\r", attdet);
	
	memcpy(pClient->ATCmdStack->ATSendbuf, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack));
	pClient->ATCmdStack->ATSendlen = strlen((char *)pClient->DataProcessStack);
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
#if NBIOT_PRINT_ERROR_CODE_TYPE
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_ERROR) {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#else
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadAttachOrDetach(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadAttachOrDetach		: 查询终端入网退网
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadAttachOrDetach(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	int netval = 0;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CGATT?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+CGATT?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "%*[^+CGATT]%*[^:]:%d", &netval) <= 0) {
			NBStatus = NBIOT_ERROR;
		}
		else {
			if ((netval == Attach) || (netval == Detach)) {
				pClient->Parameter.netstate = (NBIOT_NetstateTypeDef)netval;
			}
			else {
				NBStatus = NBIOT_ERROR;
			}
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetMinOrFullFunc(NBIOT_ClientsTypeDef* pClient, NBIOT_FunctionalityTypeDef minfull)
 @Description			NBIOT_Neul_NBxx_SetMinOrFullFunc			: 设置设备功能
 @Input				pClient								: NBIOT客户端实例
					minfull								: MinFunc / FullFunc
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetMinOrFullFunc(NBIOT_ClientsTypeDef* pClient, NBIOT_FunctionalityTypeDef minfull)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+CFUN=%d\r", minfull);
	
	memcpy(pClient->ATCmdStack->ATSendbuf, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack));
	pClient->ATCmdStack->ATSendlen = strlen((char *)pClient->DataProcessStack);
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
#if NBIOT_PRINT_ERROR_CODE_TYPE
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_ERROR) {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#else
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadMinOrFullFunc(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadMinOrFullFunc		: 查询设备功能
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadMinOrFullFunc(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	int cfunval = 0;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
